const langArr = {
  cv: {
    ru: "Моё CV",
    ua: "Моє CV",
    en: "My CV",
  },

  content: {
    ru: "Мои работы",
    ua: "Мої роботи",
    en: "Portfollio",
  },

  about: {
    ru: "Обо мне",
    ua: "Про мене",
    en: "About me",
  },

  name: {
    ru: "Савельев Игорь",
    ua: "Савельєв Ігор",
    en: "Saveliev Ihor",
  },
  
  contacts: {
    ru: "Контакты",
    ua: "Контакти",
    en: "Contacts",
  },

  service: {
    ru: "Предоставляемые услуги:",
    ua: "Послуги, що надаються:",
    en: "Services provided:",
  },
  project: {
    ru: "Особенности готового проекта:",
    ua: "Особливості проекту:",
    en: "Features of the finished project:",
  },
  support: {
    ru: "Поддержка проекта:",
    ua: "Підтримка проекту:",
    en: "Project support:",
  },

  topTitle: {
    ru: "Я - Web-разработчик, занимаюсь созданием и поддержкой сайтов.",
    ua: "Я - Web-розробник, займаюся створенням та підтримкою сайтів.",
    en: "I'm a Web developer, creating and maintaining websites.",
  },

  txt1: {
    ru: "🚀 Адаптивная вёрстка по макетам в PSD, Sketch, Figma, Adobe XD, Zeplin.",
    ua: "🚀 Створення адаптивних сайтів за макетами в PSD, Sketch, Figma, Adobe XD, Zeplin.",
    en: "🚀 Responsive layout for mockups in PSD, Sketch, Figma, Adobe XD, Zeplin.",
  },

  txt2: {
    ru: "📱 Установка CMS Wordpress/October.",
    ua: "📱 Встановлення CMS Wordpress/October.",
    en: "📱 Installing the CMS Wordpress/October.",
  },

  txt3: {
    ru: "✏️ Внесение правок, исправление проблем, как в вёрстке сайта, так и в Javascript модулях(слайдер, анимации, попап, форма обратной связи).",
    ua: "✏️ Внесення правок, виправлення проблем, як у верстці сайту, так і в Javascript модулях (слайдер, анімації, попап, форма зворотнього зв'язку).",
    en: "✏️ Making changes, fixing problems, as in the site layout and in Javascript modules (slider, animation, popup, feedback form).",
  },

  txt4: {
    ru: "🧩 Работа с СУБД (SQL, MySql).",
    ua: "🧩 Робота з СУБД (SQL, MySql).",
    en: "🧩 Work with DBMS (SQL, MySql).",
  },

  txt5: {
    ru: "💻 Оптимизированый код на чистом JavaScript и PHP, работаю с библиотеками jQuery.",
    ua: "💻 Оптимізований код на чистому JavaScript і PHP, працюю з бібліотеками jQuery.",
    en: "💻 Optimized code in pure JavaScript and PHP, working with libraries jQuery.",
  },

  txt6: {
    ru: "📐 Использование препроцессоров ( SCSS,LESS,PUG ).",
    ua: "📐 Використання препроцесорів ( SCSS,LESS,PUG ).",
    en: "📐 Using preprocessors ( SCSS,LESS,PUG ).",
  },

  txt7: {
    ru: "🎲 Кросбраузерная адаптивная семантическая верстка HTML 5 независимыми блоками по методологии БЕМ.",
    ua: "🎲 Кросбраузерна адаптивна адаптивна семантична верстка HTML 5 незалежними блоками за методологією БЕМ.",
    en: "🎲 Cross-browser adaptive semantic HTML 5 layout independent blocks according to BEM methodology.",
  },

  txt8: {
    ru: "🕐 Оптимизация для хороших результатов в тесте GooglePageSpeed.",
    ua: "🕐 Оптимізація для хороших результатів у тесті GooglePageSpeed.",
    en: "🕐 Optimization for good results in the GooglePageSpeed test.",
  },

  txt9: {
    ru: "💡 Использую сборщики проэктов Gulp/WebPack.",
    ua: "💡 Використовую збирачі проєктів Gulp/WebPack.",
    en: "💡 I use the Gulp/WebPack project builders.",
  },

  txt10: {
    ru: "🔧 Подключение и настройка JavaScript компонентов (AOSP, GSOCK, Swiper, Slick).",
    ua: "🔧 Підключення та налаштування JavaScript компонентів (AOSP, GSOCK, Swiper, Slick).",
    en: "🔧 Connecting and configuring JavaScript components (AOSP, GSOCK, Swiper, Slick).",
  },

  txt11: {
    ru: "📄 Реализация pixel perfect.",
    ua: "📄 Реалізація pixel perfect.",
    en: "📄 Implementation of pixel perfect.",
  },

  txt12: {
    ru: "📎 Правки как в вёрстке так и в CMS.",
    ua: "📎 Правки як у верстці сайту так і в CMS.",
    en: "📎 Edits both in the layout and in the CMS.",
  },

  txt13: {
    ru: "💬 Консультации и реализация дополнительных задач.",
    ua: "💬 Консультації та реалізація додаткових завдач.",
    en: "💬 Consultations and implementation of additional tasks.",
  },

  txt14: {
    ru: "На связи 24/7! Буду рад поработать именно с Вами, обращайтесь!",
    ua: "На зв'язку 24/7! Буду радий попрацювати саме з Вами, звертайтеся!",
    en: "In touch 24/7! I will be glad to work with you, contact me!",
  },
};